export const TextForSlider = [
    {
        type: "ayat",
        description: "বলুন, যারা জানে এবং যারা জানে না তারা কি সমান হতে পারে?",
        ref: "সুরা আয-যুমার: ৯",
    },

    {
        type: "ayat",
        description: "আল্লাহ তাদের মর্যাদা বৃদ্ধি করবেন যারা ঈমান এনেছেন এবং যাদেরকে জ্ঞান দান করা হয়েছে।",
        ref: "সুরা আল-মুজাদালাহ: ১১",
    },

    {
        type: "ayat",
        description: "বলুন, হে আমার রব! আমাকে জ্ঞান বৃদ্ধি করুন।",
        ref: "সুরা ত্বহা: ১১৪",
    },

    {
        type: "ayat",
        description: "আল্লাহ সাক্ষ্য দিয়েছেন যে, তিনি ছাড়া কোনো উপাস্য নেই এবং ফেরেশতাগণ ও জ্ঞানী লোকেরাও সাক্ষ্য দিয়েছেন।",
        ref: "সুরা আলে ইমরান: ১৮",
    },

    {
        type: "ayat",
        description: "নিশ্চয়ই আকাশমণ্ডলী ও পৃথিবীর সৃষ্টিতে এবং দিন-রাত্রির পরিবর্তনে বিবেকবানদের জন্য নিদর্শন রয়েছে।",
        ref: "সুরা আলে ইমরান: ১৯০",
    },

    {
        type: "hadith",
        description: "ইলম অর্জন করা প্রত্যেক মুসলিম নর-নারীর উপর ফরজ।",
        ref: "ইবনে মাজাহ: ২২৪",
    },

    {
        type: "hadith",
        description: "আল্লাহ যার কল্যাণ কামনা করেন, তাকে দ্বীনের জ্ঞান দান করেন।",
        ref: "বুখারি: ৭১, মুসলিম: ১০৩৭",
    },

    {
        type: "hadith",
        description: "যে ব্যক্তি ইলমের সন্ধানে বের হয়, আল্লাহ তার জন্য জান্নাতের পথ সহজ করে দেন।",
        ref: "মুসলিম: ২৬৯৯",
    },

    // {
    //     type: "hadith",
    //     description: "যখন মানুষ মারা যায়, তখন তার সব আমল বন্ধ হয়ে যায়। তবে তিনটি জিনিস (অবশিষ্ট থাকে): সদকায়ে জারিয়া, এমন ইলম যা মানুষের উপকারে আসে, বা এমন নেক সন্তান, যে তার জন্য দোয়া করে।",
    //     ref: "মুসলিম: ১৬৩১",
    // },

    {
        type: "hadith",
        description: "একজন জ্ঞানী ব্যক্তি ইবাদতকারী থেকে অনেক উত্তম, যেমন চাঁদ সমস্ত নক্ষত্রের উপর আলোকিত।",
        ref: "আবু দাউদ: ৩৬৪১",
    }

]